tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1789_tdd.h
#define EEADRL                        522
#define EEADRH                        523
#define EEDATL                        524
#define EEDATH                        525
#define EECON1                        526
#define RD                            527
#define WR                            528
#define WREN                          529
#define WRERR                         530
#define FREE                          531
#define LWLO                          532
#define CFGS                          533
#define EEPGD                         534
#define EECON2                        535
#define VREGCON                       536
#define VREGPM                        537
#define RC1REG                        538
#define TX1REG                        539
#define SP1BRGL                       540
#define SP1BRGH                       541
#define RC1STA                        542
#define RX9D                          543
#define OERR                          544
#define FERR                          545
#define ADDEN                         546
#define CREN                          547
#define SREN                          548
#define RX9                           549
#define SPEN                          550
#define TX1STA                        551
#define TX9D                          552
#define TRMT                          553
#define BRGH                          554
#define SENDB                         555
#define SYNC                          556
#define TXEN                          557
#define TX9                           558
#define CSRC                          559
#define BAUD1CON                      560
#define ABDEN                         561
#define WUE                           562
#define BRG16                         563
#define SCKP                          564
#define RCIDL                         565
#define ABDOVF                        566
#define WPUA0                         567
#define WPUA                          568
#define WPUA1                         569
#define WPUA2                         570
#define WPUA3                         571
#define WPUA4                         572
#define WPUA5                         573
#define WPUA6                         574
#define WPUA7                         575
#define WPUB0                         576
#define WPUB                          577
#define WPUB1                         578
#define WPUB2                         579
#define WPUB3                         580
#define WPUB4                         581
#define WPUB5                         582
#define WPUB6                         583
#define WPUB7                         584
#define WPUC0                         585
#define WPUC                          586
#define WPUC1                         587
#define WPUC2                         588
#define WPUC3                         589
#define WPUC4                         590
#define WPUC5                         591
#define WPUC6                         592
#define WPUC7                         593
#define WPUD                          594
#define WPUD0                         595
#define WPUD1                         596
#define WPUD2                         597
#define WPUD3                         598
#define WPUD4                         599
#define WPUD5                         600
#define WPUD6                         601
#define WPUD7                         602
#define WPUE                          603
#define WPUE0                         604
#define WPUE1                         605
#define WPUE2                         606
#define WPUE3                         607
#define SSP1BUF                       608
#define BUF                           609
#define BUF0                          610
#define SSP1BUF0                      611
#define BUF1                          612
#define SSP1BUF1                      613
#define BUF2                          614
#define SSP1BUF2                      615
#define BUF3                          616
#define SSP1BUF3                      617
#define BUF4                          618
#define SSP1BUF4                      619
#define BUF5                          620
#define SSP1BUF5                      621
#define BUF6                          622
#define SSP1BUF6                      623
#define BUF7                          624
#define SSP1BUF7                      625
#define ADD0                          626
#define ADD                           627
#define SSP1ADD0                      628
#define SSP1ADD                       629
#define ADD1                          630
#define SSP1ADD1                      631
#define ADD2                          632
#define SSP1ADD2                      633
#define ADD3                          634
#define SSP1ADD3                      635
#define ADD4                          636
#define SSP1ADD4                      637
#define ADD5                          638
#define SSP1ADD5                      639
#define ADD6                          640
#define SSP1ADD6                      641
#define ADD7                          642
#define SSP1ADD7                      643
#define SSP1MSK0                      644
#define SSP1MSK                       645
#define MSK0                          646
#define MSK                           647
#define SSP1MSK1                      648
#define MSK1                          649
#define SSP1MSK2                      650
#define MSK2                          651
#define SSP1MSK3                      652
#define MSK3                          653
#define SSP1MSK4                      654
#define MSK4                          655
#define SSP1MSK5                      656
#define MSK5                          657
#define SSP1MSK6                      658
#define MSK6                          659
#define SSP1MSK7                      660
#define MSK7                          661
#define SSP1STAT                      662
#define BF                            663
#define UA                            664
#define R_nW                          665
#define S                             666
#define P                             667
#define D_nA                          668
#define CKE                           669
#define SMP                           670
#define SSP1CON1                      671
#define SSPM0                         672
#define SSPM                          673
#define SSPM1                         674
#define SSPM2                         675
#define SSPM3                         676
#define CKP                           677
#define SSPEN                         678
#define SSPOV                         679
#define WCOL                          680
#define SSP1CON2                      681
#define SEN                           682
#define RSEN                          683
#define PEN                           684
#define RCEN                          685
#define ACKEN                         686
#define ACKDT                         687
#define ACKSTAT                       688
#define GCEN                          689
#define SSP1CON3                      690
#define DHEN                          691
#define AHEN                          692
#define SBCDE                         693
#define SDAHT                         694
#define BOEN                          695
#define SCIE                          696
#define PCIE                          697
#define ACKTIM                        698
#define ODCONA0                       699
#define ODCONA                        700
#define ODCONA1                       701
#define ODCONA2                       702
#define ODCONA3                       703
#define ODCONA4                       704
#define ODCONA5                       705
#define ODCONA6                       706
#define ODCONA7                       707
#define ODCONB0                       708
#define ODCONB                        709
#define ODCONB1                       710
#define ODCONB2                       711
#define ODCONB3                       712
#define ODCONB4                       713
#define ODCONB5                       714
#define ODCONB6                       715
#define ODCONB7                       716
#define ODCONC0                       717
#define ODCONC                        718
#define ODCONC1                       719
#define ODCONC2                       720
#define ODCONC3                       721
#define ODCONC4                       722
#define ODCONC5                       723
#define ODCONC6                       724
#define ODCONC7                       725
#define ODCOND0                       726
#define ODCOND                        727
#define ODCOND1                       728
#define ODCOND2                       729
#define ODCOND3                       730
#define ODCOND4                       731
#define ODCOND5                       732
#define ODCOND6                       733
#define ODCOND7                       734
#define ODCONE0                       735
#define ODCONE                        736
#define ODCONE1                       737
#define ODCONE2                       738
#define CCPR1L                        739
#define CCPR1H                        740
#define CCP1CON                       741
#define CCP1M0                        742
#define CCP1M                         743
#define CCP1M1                        744
#define CCP1M2                        745
#define CCP1M3                        746
#define DC1B                          747
#define DC1B0                         748
#define DC1B1                         749
#define CCPR2L                        750
#define CCPR2H                        751
#define CCP2CON                       752
#define CCP2M                         753
#define CCP2M0                        754
#define CCP2M1                        755
#define CCP2M2                        756
#define CCP2M3                        757
#define DC2B0                         758
#define DC2B                          759
#define DC2B1                         760
#define SLRCONA0                      761
#define SLRCONA                       762
#define SLRCONA1                      763
#define SLRCONA2                      764
#define SLRCONA3                      765
#define SLRCONA4                      766
#define SLRCONA5                      767
#define SLRCONA6                      768
#define SLRCONA7                      769
#define SLRCONB                       770
#define SLRCONB0                      771
#define SLRCONB1                      772
#define SLRCONB2                      773
#define SLRCONB3                      774
#define SLRCONB4                      775
#define SLRCONB5                      776
#define SLRCONB6                      777
#define SLRCONB7                      778
#define SLRCONC                       779
#define SLRCONC0                      780
#define SLRCONC1                      781
#define SLRCONC2                      782
#define SLRCONC3                      783
#define SLRCONC4                      784
#define SLRCONC5                      785
#define SLRCONC6                      786
#define SLRCONC7                      787
#define SLRCOND0                      788
#define SLRCOND                       789
#define SLRCOND1                      790
#define SLRCOND2                      791
#define SLRCOND3                      792
#define SLRCOND4                      793
#define SLRCOND5                      794
#define SLRCOND6                      795
#define SLRCOND7                      796
#define SLRCONE0                      797
#define SLRCONE                       798
#define SLRCONE1                      799
#define SLRCONE2                      800
#define CCPR3L                        801
#define CCPR3H                        802
#define CCP3CON                       803
#define CCP3M                         804
#define CCP3M0                        805
#define CCP3M1                        806
#define CCP3M2                        807
#define CCP3M3                        808
#define DC3B                          809
#define DC3B0                         810
#define DC3B1                         811
#define INLVLA                        812
#define INLVLA0                       813
#define INLVLA1                       814
#define INLVLA2                       815
#define INLVLA3                       816
#define INLVLA4                       817
#define INLVLA5                       818
#define INLVLA6                       819
#define INLVLA7                       820
#define INLVLB                        821
#define INLVLB0                       822
#define INLVLB1                       823
#define INLVLB2                       824
#define INLVLB3                       825
#define INLVLB4                       826
#define INLVLB5                       827
#define INLVLB6                       828
#define INLVLB7                       829
#define INLVLC                        830
#define INLVLC0                       831
#define INLVLC1                       832
#define INLVLC2                       833
#define INLVLC3                       834
#define INLVLC4                       835
#define INLVLC5                       836
#define INLVLC6                       837
#define INLVLC7                       838
#define INLVLD0                       839
#define INLVLD                        840
#define INLVLD1                       841
#define INLVLD2                       842
#define INLVLD3                       843
#define INLVLD4                       844
#define INLVLD5                       845
#define INLVLD6                       846
#define INLVLD7                       847
#define INLVLE                        848
#define INLVLE0                       849
#define INLVLE1                       850
#define INLVLE2                       851
#define INLVLE3                       852
#define IOCAP                         853
#define IOCAP0                        854
#define IOCAP1                        855
#define IOCAP2                        856
#define IOCAP3                        857
#define IOCAP4                        858
#define IOCAP5                        859
#define IOCAP6                        860
#define IOCAP7                        861
#define IOCAN                         862
#define IOCAN0                        863
#define IOCAN1                        864
#define IOCAN2                        865
#define IOCAN3                        866
#define IOCAN4                        867
#define IOCAN5                        868
#define IOCAN6                        869
#define IOCAN7                        870
#define IOCAF0                        871
#define IOCAF                         872
#define IOCAF1                        873
#define IOCAF2                        874
#define IOCAF3                        875
#define IOCAF4                        876
#define IOCAF5                        877
#define IOCAF6                        878
#define IOCAF7                        879
#define IOCBP                         880
#define IOCBP0                        881
#define IOCBP1                        882
#define IOCBP2                        883
#define IOCBP3                        884
#define IOCBP4                        885
#define IOCBP5                        886
#define IOCBP6                        887
#define IOCBP7                        888
#define IOCBN0                        889
#define IOCBN                         890
#define IOCBN1                        891
#define IOCBN2                        892
#define IOCBN3                        893
#define IOCBN4                        894
#define IOCBN5                        895
#define IOCBN6                        896
#define IOCBN7                        897
#define IOCBF0                        898
#define IOCBF                         899
#define IOCBF1                        900
#define IOCBF2                        901
#define IOCBF3                        902
#define IOCBF4                        903
#define IOCBF5                        904
#define IOCBF6                        905
#define IOCBF7                        906
#define IOCCP0                        907
#define IOCCP                         908
#define IOCCP1                        909
#define IOCCP2                        910
#define IOCCP3                        911
#define IOCCP4                        912
#define IOCCP5                        913
#define IOCCP6                        914
#define IOCCP7                        915
#define IOCCN0                        916
#define IOCCN                         917
#define IOCCN1                        918
#define IOCCN2                        919
#define IOCCN3                        920
#define IOCCN4                        921
#define IOCCN5                        922
#define IOCCN6                        923
#define IOCCN7                        924
#define IOCCF0                        925
#define IOCCF                         926
#define IOCCF1                        927
#define IOCCF2                        928
#define IOCCF3                        929
#define IOCCF4                        930
#define IOCCF5                        931
#define IOCCF6                        932
#define IOCCF7                        933
#define IOCEP                         934
#define IOCEP3                        935
#define IOCEN                         936
#define IOCEN3                        937
#define IOCEF                         938
#define IOCEF3                        939
#define OPA1CON                       940
#define OPA1CON_PCH                   941
#define OPA1PCH                       942
#define OPA1CON_PCH0                  943
#define OPA1PCH0                      944
#define OPA1CON_PCH1                  945
#define OPA1PCH1                      946
#define OPA1PCH2                      947
#define OPA1CON_PCH2                  948
#define OPA1CON_SP                    949
#define OPA1SP                        950
#define OPA1CON_EN                    951
#define OPA1EN                        952
#define OPA2CON                       953
#define OPA2CON_PCH                   954
#define OPA2CON_PCH0                  955
#define OPA2PCH                       956
#define OPA2PCH0                      957
#define OPA2CON_PCH1                  958
#define OPA2PCH1                      959
#define OPA2CON_PCH2                  960
#define OPA2PCH2                      961
#define OPA2CON_SP                    962
#define OPA2SP                        963
#define OPA2EN                        964
#define OPA2CON_EN                    965
#define OPA3CON                       966
#define OPA3CON_PCH0                  967
#define OPA3CON_PCH                   968
#define OPA3PCH                       969
#define OPA3PCH0                      970
#define OPA3CON_PCH1                  971
#define OPA3PCH1                      972
#define OPA3CON_PCH2                  973
#define OPA3PCH2                      974
#define OPA3SP                        975
#define OPA3CON_SP                    976
#define OPA3CON_EN                    977
#define OPA3EN                        978
#define CLKRCON                       979
#define CLKRDIV                       980
#define CLKRDIV0                      981
#define CLKRDIV1                      982
#define CLKRDIV2                      983
#define CLKRDC                        984
#define CLKRDC0                       985
#define CLKRDC1                       986
#define CLKRSLR                       987
#define CLKROE                        988
#define CLKREN                        989
#define DAC2CON0                      990
#define DAC2PSS                       991
#define DAC2OE2                       992
#define DAC2OE1                       993
#define DAC2EN                        994
#define DAC2REF                       995
#define DAC2R                         996
#define DAC3CON0                      997
#define DAC3PSS                       998
#define DAC3OE2                       999
#define DAC3OE1                       1000
#define DAC3EN                        1001
#define DAC3REF                       1002
#define DAC3R                         1003
#define DAC4CON0                      1004
#define DAC4PSS                       1005
#define DAC4OE2                       1006
#define DAC4OE1                       1007
#define DAC4EN                        1008
#define DAC4REF                       1009
#define DAC4R                         1010
#define PSMC1CON                      1011
#define P1MODE                        1012
#define P1MODE0                       1013
#define P1MODE1                       1014
#define P1MODE2                       1015
#define P1MODE3                       1016
#define P1DBRE                        1017
#define P1DBFE                        1018
#define PSMC1LD                       1019
#define PSMC1EN                       1020
#define PSMC1MDL                      1021
#define P1MSRC0                       1022
#define P1MSRC                        1023
#define P1MSRC1                       1024
#define P1MSRC2                       1025
#define P1MSRC3                       1026
#define P1MDLBIT                      1027
#define P1MDLPOL                      1028
#define P1MDLEN                       1029
#define PSMC1SYNC                     1030
#define P1SYNC0                       1031
#define P1SYNC1                       1032
#define P1SYNC2                       1033
#define P1DCPOL                       1034
#define P1PRPOL                       1035
#define P1POFST                       1036
#define PSMC1CLK                      1037
#define P1CSRC                        1038
#define P1CSRC0                       1039
#define P1CSRC1                       1040
#define P1CPRE                        1041
#define P1CPRE0                       1042
#define P1CPRE1                       1043
#define PSMC1OEN                      1044
#define P1OEA                         1045
#define P1OEB                         1046
#define P1OEC                         1047
#define P1OED                         1048
#define P1OEE                         1049
#define P1OEF                         1050
#define PSMC1POL                      1051
#define P1POLA                        1052
#define P1POLB                        1053
#define P1POLC                        1054
#define P1POLD                        1055
#define P1POLE                        1056
#define P1POLF                        1057
#define P1INPOL                       1058
#define PSMC1BLNK                     1059
#define P1REBM                        1060
#define P1REBM0                       1061
#define P1REBM1                       1062
#define P1FEBM0                       1063
#define P1FEBM                        1064
#define P1FEBM1                       1065
#define PSMC1REBS                     1066
#define P1REBSC1                      1067
#define P1REBSC2                      1068
#define P1REBSC3                      1069
#define P1REBSC4                      1070
#define P1REBSIN                      1071
#define PSMC1FEBS                     1072
#define P1FEBSC1                      1073
#define P1FEBSC2                      1074
#define P1FEBSC3                      1075
#define P1FEBSC4                      1076
#define P1FEBSIN                      1077
#define PSMC1PHS                      1078
#define P1PHST                        1079
#define P1PHSC1                       1080
#define P1PHSC2                       1081
#define P1PHSC3                       1082
#define P1PHSC4                       1083
#define P1PHSIN                       1084
#define PSMC1DCS                      1085
#define P1DCST                        1086
#define P1DCSC1                       1087
#define P1DCSC2                       1088
#define P1DCSC3                       1089
#define P1DCSC4                       1090
