tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1789_tdd.h
#define PSMC3TMR6                     1649
#define PSMC3TMR7                     1650
#define PSMC3TMRH                     1651
#define PSMC3TMR8                     1652
#define PSMC3TMR9                     1653
#define PSMC3TMR10                    1654
#define PSMC3TMR11                    1655
#define PSMC3TMR12                    1656
#define PSMC3TMR13                    1657
#define PSMC3TMR14                    1658
#define PSMC3TMR15                    1659
#define PSMC3DBR                      1660
#define PSMC3DBR0                     1661
#define PSMC3DBR1                     1662
#define PSMC3DBR2                     1663
#define PSMC3DBR3                     1664
#define PSMC3DBR4                     1665
#define PSMC3DBR5                     1666
#define PSMC3DBR6                     1667
#define PSMC3DBR7                     1668
#define PSMC3DBF                      1669
#define PSMC3DBF0                     1670
#define PSMC3DBF1                     1671
#define PSMC3DBF2                     1672
#define PSMC3DBF3                     1673
#define PSMC3DBF4                     1674
#define PSMC3DBF5                     1675
#define PSMC3DBF6                     1676
#define PSMC3DBF7                     1677
#define PSMC3BLKR                     1678
#define PSMC3BLKR0                    1679
#define PSMC3BLKR1                    1680
#define PSMC3BLKR2                    1681
#define PSMC3BLKR3                    1682
#define PSMC3BLKR4                    1683
#define PSMC3BLKR5                    1684
#define PSMC3BLKR6                    1685
#define PSMC3BLKR7                    1686
#define PSMC3BLKF                     1687
#define PSMC3BLKF0                    1688
#define PSMC3BLKF1                    1689
#define PSMC3BLKF2                    1690
#define PSMC3BLKF3                    1691
#define PSMC3BLKF4                    1692
#define PSMC3BLKF5                    1693
#define PSMC3BLKF6                    1694
#define PSMC3BLKF7                    1695
#define PSMC3FFA                      1696
#define PSMC3FFA0                     1697
#define PSMC3FFA1                     1698
#define PSMC3FFA2                     1699
#define PSMC3FFA3                     1700
#define PSMC3STR0                     1701
#define P3STRA                        1702
#define P3STRB                        1703
#define P3STRC                        1704
#define P3STRD                        1705
#define P3STRE                        1706
#define P3STRF                        1707
#define PSMC3STR1                     1708
#define P3HSMEN                       1709
#define P3LSMEN                       1710
#define P3SSYNC                       1711
#define PSMC4CON                      1712
#define P4MODE                        1713
#define P4MODE0                       1714
#define P4MODE1                       1715
#define P4MODE2                       1716
#define P4MODE3                       1717
#define P4DBRE                        1718
#define P4DBFE                        1719
#define PSMC4LD                       1720
#define PSMC4EN                       1721
#define PSMC4MDL                      1722
#define P4MSRC                        1723
#define P4MSRC0                       1724
#define P4MSRC1                       1725
#define P4MSRC2                       1726
#define P4MSRC3                       1727
#define P4MDLBIT                      1728
#define P4MDLPOL                      1729
#define P4MDLEN                       1730
#define PSMC4SYNC                     1731
#define P4SYNC0                       1732
#define P4SYNC1                       1733
#define P4SYNC2                       1734
#define P4DCPOL                       1735
#define P4PRPOL                       1736
#define P4POFST                       1737
#define PSMC4CLK                      1738
#define P4CSRC0                       1739
#define P4CSRC                        1740
#define P4CSRC1                       1741
#define P4CPRE0                       1742
#define P4CPRE                        1743
#define P4CPRE1                       1744
#define PSMC4OEN                      1745
#define P4OEA                         1746
#define P4OEB                         1747
#define PSMC4POL                      1748
#define P4POLA                        1749
#define P4POLB                        1750
#define P4INPOL                       1751
#define PSMC4BLNK                     1752
#define P4REBM0                       1753
#define P4REBM                        1754
#define P4REBM1                       1755
#define P4FEBM0                       1756
#define P4FEBM                        1757
#define P4FEBM1                       1758
#define PSMC4REBS                     1759
#define P4REBSC1                      1760
#define P4REBSC2                      1761
#define P4REBSC3                      1762
#define P4REBSC4                      1763
#define P4REBSIN                      1764
#define PSMC4FEBS                     1765
#define P4FEBSC1                      1766
#define P4FEBSC2                      1767
#define P4FEBSC3                      1768
#define P4FEBSC4                      1769
#define P4FEBSIN                      1770
#define PSMC4PHS                      1771
#define P4PHST                        1772
#define P4PHSC1                       1773
#define P4PHSC2                       1774
#define P4PHSC3                       1775
#define P4PHSC4                       1776
#define P4PHSIN                       1777
#define PSMC4DCS                      1778
#define P4DCST                        1779
#define P4DCSC1                       1780
#define P4DCSC2                       1781
#define P4DCSC3                       1782
#define P4DCSC4                       1783
#define P4DCSIN                       1784
#define PSMC4PRS                      1785
#define P4PRST                        1786
#define P4PRSC1                       1787
#define P4PRSC2                       1788
#define P4PRSC3                       1789
#define P4PRSC4                       1790
#define P4PRSIN                       1791
#define PSMC4ASDC                     1792
#define P4ASDOV                       1793
#define P4ARSEN                       1794
#define P4ASDEN                       1795
#define P4ASE                         1796
#define PSMC4ASDL                     1797
#define P4ASDLA                       1798
#define P4ASDLB                       1799
#define PSMC4ASDS                     1800
#define P4ASDSC1                      1801
#define P4ASDSC2                      1802
#define P4ASDSC3                      1803
#define P4ASDSC4                      1804
#define P4ASDSIN                      1805
#define PSMC4INT                      1806
#define P4TPRIF                       1807
#define P4TDCIF                       1808
#define P4TPHIF                       1809
#define P4TOVIF                       1810
#define P4TPRIE                       1811
#define P4TDCIE                       1812
#define P4TPHIE                       1813
#define P4TOVIE                       1814
#define PSMC4PHL                      1815
#define PSMC4PH0                      1816
#define PSMC4PH1                      1817
#define PSMC4PH2                      1818
#define PSMC4PH3                      1819
#define PSMC4PH4                      1820
#define PSMC4PH5                      1821
#define PSMC4PH6                      1822
#define PSMC4PH7                      1823
#define PSMC4PHH                      1824
#define PSMC4PH8                      1825
#define PSMC4PH9                      1826
#define PSMC4PH10                     1827
#define PSMC4PH11                     1828
#define PSMC4PH12                     1829
#define PSMC4PH13                     1830
#define PSMC4PH14                     1831
#define PSMC4PH15                     1832
#define PSMC4DCL                      1833
#define PSMC4DC0                      1834
#define PSMC4DC1                      1835
#define PSMC4DC2                      1836
#define PSMC4DC3                      1837
#define PSMC4DC4                      1838
#define PSMC4DC5                      1839
#define PSMC4DC6                      1840
#define PSMC4DC7                      1841
#define PSMC4DCH                      1842
#define PSMC4DC8                      1843
#define PSMC4DC9                      1844
#define PSMC4DC10                     1845
#define PSMC4DC11                     1846
#define PSMC4DC12                     1847
#define PSMC4DC13                     1848
#define PSMC4DC14                     1849
#define PSMC4DC15                     1850
#define PSMC4PRL                      1851
#define PSMC4PR0                      1852
#define PSMC4PR1                      1853
#define PSMC4PR2                      1854
#define PSMC4PR3                      1855
#define PSMC4PR4                      1856
#define PSMC4PR5                      1857
#define PSMC4PR6                      1858
#define PSMC4PR7                      1859
#define PSMC4PRH                      1860
#define PSMC4PR8                      1861
#define PSMC4PR9                      1862
#define PSMC4PR10                     1863
#define PSMC4PR11                     1864
#define PSMC4PR12                     1865
#define PSMC4PR13                     1866
#define PSMC4PR14                     1867
#define PSMC4PR15                     1868
#define PSMC4TMRL                     1869
#define PSMC4TMR0                     1870
#define PSMC4TMR1                     1871
#define PSMC4TMR2                     1872
#define PSMC4TMR3                     1873
#define PSMC4TMR4                     1874
#define PSMC4TMR5                     1875
#define PSMC4TMR6                     1876
#define PSMC4TMR7                     1877
#define PSMC4TMRH                     1878
#define PSMC4TMR8                     1879
#define PSMC4TMR9                     1880
#define PSMC4TMR10                    1881
#define PSMC4TMR11                    1882
#define PSMC4TMR12                    1883
#define PSMC4TMR13                    1884
#define PSMC4TMR14                    1885
#define PSMC4TMR15                    1886
#define PSMC4DBR                      1887
#define PSMC4DBR0                     1888
#define PSMC4DBR1                     1889
#define PSMC4DBR2                     1890
#define PSMC4DBR3                     1891
#define PSMC4DBR4                     1892
#define PSMC4DBR5                     1893
#define PSMC4DBR6                     1894
#define PSMC4DBR7                     1895
#define PSMC4DBF                      1896
#define PSMC4DBF0                     1897
#define PSMC4DBF1                     1898
#define PSMC4DBF2                     1899
#define PSMC4DBF3                     1900
#define PSMC4DBF4                     1901
#define PSMC4DBF5                     1902
#define PSMC4DBF6                     1903
#define PSMC4DBF7                     1904
#define PSMC4BLKR                     1905
#define PSMC4BLKR0                    1906
#define PSMC4BLKR1                    1907
#define PSMC4BLKR2                    1908
#define PSMC4BLKR3                    1909
#define PSMC4BLKR4                    1910
#define PSMC4BLKR5                    1911
#define PSMC4BLKR6                    1912
#define PSMC4BLKR7                    1913
#define PSMC4BLKF                     1914
#define PSMC4BLKF0                    1915
#define PSMC4BLKF1                    1916
#define PSMC4BLKF2                    1917
#define PSMC4BLKF3                    1918
#define PSMC4BLKF4                    1919
#define PSMC4BLKF5                    1920
#define PSMC4BLKF6                    1921
#define PSMC4BLKF7                    1922
#define PSMC4FFA                      1923
#define PSMC4FFA0                     1924
#define PSMC4FFA1                     1925
#define PSMC4FFA2                     1926
#define PSMC4FFA3                     1927
#define PSMC4STR0                     1928
#define P4STRA                        1929
#define P4STRB                        1930
#define PSMC4STR1                     1931
#define P4HSMEN                       1932
#define P4LSMEN                       1933
#define P4SSYNC                       1934
#define STATUS_SHAD                   1935
#define C_SHAD                        1936
#define DC_SHAD                       1937
#define Z_SHAD                        1938
#define WREG_SHAD                     1939
#define BSR_SHAD                      1940
#define PCLATH_SHAD                   1941
#define FSR0L_SHAD                    1942
#define FSR0H_SHAD                    1943
#define FSR1L_SHAD                    1944
#define FSR1H_SHAD                    1945
#define STKPTR                        1946
#define TOSL                          1947
#define TOSH                          1948

#endif // _PIC16F1789_H_
